# 集合是可变类型数据
# 集合增加数据的方法
# 1. add()
s1 = {10, 20}
s1.add(60)
print(s1)
# {60, 10, 20}
s1.add(60)
# {100, 10, 20}不会再增加个100，因为集合有去重功能
# s1.add([10, 20, 30])  --> 会报错，add()只能用于增加数据

# update追加的是序列
s1.update([10, 20, 30, 40, 50])
print(s1)
# {100, 40, 10, 50, 20, 30} --> 用序列的方式增加数据

# remove() --> 删除集合中的指定数据，如果数据不存在则报错
s1.remove(10)
print(s1)
# {100, 40, 50, 20, 30}

# discard() --> 删除集合中的指定数据，如果数据不存在 不会 报错
s1.discard(10)
print(s1)
# {40, 50, 20, 30}

# pop() --> 随机删除数据
del_s1 = s1.pop()
print(s1)      # {50, 20, 60, 30}
print(del_s1)  # 40

s2 = [10, 20, 30, 40, 50]
# in 或 not in 判断数据10是否存在集合中，返回布尔值
print(10 in s2)       # True
print(70 not in s2)   # True