# 需要借用 os 模块来进行相关操作
'''
1. 导入模块os
2. 使用模块内功能
'''
import os
# 1. rename(): 重命名
# os.rename(原文件(夹)名称src, 新文件(夹)名称)  # src 为文件路径
# 如果要测试请先创建一个 'test10.txt' 的文件
# os.rename('test10.txt', 'test2.txt')

# 2. remove():删除文件
# os.remove(目标文件(夹)名)
# os.remove('test2.txt')

# 3. 创建文件夹
# os.mkdir(文件夹名字)
# os.mkdir('aa')
# 如果再次创建该文件夹则会报错，因为不允许同名文件夹

# 4. 删除文件夹
# os.rmdir(文件夹名字)
# os.rmdir('aa')

# 5. 返回当前文件所在目录路径
# os.getcwd()
# print(os.getcwd())
# E:\VsCodeProject

# 6. 改变目录路径
# os.chdir()
# os.mkdir('aa')
# os.mkdir('bb')
# 创建的是两个同级的文件夹
# 要求：在 aa 里创建 bb 文件夹：1. 切换目录到 aa, 2. 创建 bb
# os.mkdir('aa')
# os.chdir('aa')
# os.mkdir('bb')

# 7. 获取目录列表
# os.listdir(目录)
# print(os.listdir())
'''
['00-Notes.py', '01-注释.py', '02-定义变量.py', '03-Debug工具.py', '04-数据类型.py', '05-格式化输出.py', '06-格式化字符串拓展.py', '07-f格式化字符串.py', '08-转义字符.py', '09-结束符.py', '10-输入.py', '11-转化数据类型.py', '12-运算符.py', '13-条件语句.py', '14-if嵌套结构.py', '15-三目运算符.py', '16-循环的应用.py', '17-while循坏嵌套.py', '18-for循环.py', '19-while...else.py', '20-for...else.py', '21-下标.py', '22-切片.py', '23-字符串常用操作.py', '24-列表.py', '25-列表数据增减.py', '26-列表数据修改.py', '27-列表复制.py', '28-列表循环遍历.py', '29-列表嵌套.py', '30-列表综合运用.py', '31-元组.py', '32-元组的常见操作.py', '33-字典.py', '34-字典基本操作.py', '35-字典中get进阶.py', '36-字典循环遍历.py', '37-字典排序与合并.py', '38-集合.py', '39-集合常用的操作方法.py', '40-集合数学运算.py', '41-公共操作.py', '42-推导式.py', '43-函数.py', '44-函数注意事项.py', '45-函数参数作用.py', '46-函数返回值作用.py', '47-函数说明文档.py', '48-函数嵌套调用.py', '49-函数嵌套的运用.py', '50-函数变量作用域.py', '51-函数的返回值.py', '52-函数的参数.py', '53-拆包.py', '54-交换变量值.py', '55-引用.py', '56-引用当实参传递.py', '57-学员信息系统制作.py', '58-递归.py', '59-lambda表达式.py', '60-lambda参数形式.py', '61-lambda的应用.py', '62-高阶函数.py', '63-文件操作.py', '64-访问模式.py', '65-读取函数之read.py', '66-访问模式特点.py', '67-seek移动文件指针.py', '68-文件备份.py', '69-文件与文件夹操作.py', 'test.txt', 'test[备份].txt']'''
# 获取文件夹里所有文件名，并且返回一个列表